terminator0010/Ros2_Drone/Ros2_esp32/main/micro-ros-esp32.cpp
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "sdkconfig.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "driver/i2c.h" // Incluído para controle do PCA9685
#include "driver/uart.h"
#include "esp_log.h"

// Garante que o compilador C++ não modifique o nome destas funções em C
extern "C" {
#include "esp32_serial_transport.h"
#include "uros_network_interfaces.h"
}

#include "rcl/rcl.h"
#include "rclc/executor.h"
#include "rclc/rclc.h"

#include "rmw_microros/rmw_microros.h"
#include "sensor_msgs/msg/joy.h"
#include <std_msgs/msg/float32.h>

#include "esp_adc/adc_oneshot.h"

#define MICRO_ROS_TASK_STACK_SIZE 8192
#define MICRO_ROS_TASK_PRIORITY 5

// Limites para evitar vazamento de memória (Ghost axes no Linux)
#define MAX_AXES 16
#define MAX_BUTTONS 40
#define MAX_STRING_LEN 30

// --- CONFIGURAÇÕES DO FAILSAFE E WATCHDOG ---
#define FAILSAFE_TIMEOUT_MS 500 // 0.5 segundos sem comandos = Emergência
static TickType_t last_msg_time = 0;
static bool failsafe_active =
    true; // Inicia bloqueado (Emergência) por segurança
static const char *TAG = "HIL_CONTROLLER";

// --- DEFINIÇÕES I2C (PCA9685) ---
#define I2C_MASTER_SCL_IO 2
#define I2C_MASTER_SDA_IO 21
#define I2C_MASTER_NUM I2C_NUM_0
#define I2C_MASTER_FREQ_HZ 100000
#define PCA9685_ADDR 0x40

#define PCA9685_MODE1 0x00
#define PCA9685_PRESCALE 0xFE
#define LED0_ON_L 0x06
#define LED0_ON_H 0x07
#define LED0_OFF_L 0x08
#define LED0_OFF_H 0x09

#define RUDDER_MIN_DEG -24.0f
#define RUDDER_CENTER_DEG 0.0f
#define RUDDER_MAX_DEG 24.0f

#define RUDDER_PWM_MIN 150
#define RUDDER_PWM_CENTER 300
#define RUDDER_PWM_MAX 600

#define AILERON_MIN_DEG -20.0f
#define AILERON_CENTER_DEG 0.0f
#define AILERON_MAX_DEG 20.0f

#define AILERON_PWM_MIN 150
#define AILERON_PWM_CENTER 300
#define AILERON_PWM_MAX 600

#define ELEVATOR_MIN_DEG -28.0f
#define ELEVATOR_CENTER_DEG 0.0f
#define ELEVATOR_MAX_DEG 28.0f

#define ELEVATOR_PWM_MIN 150
#define ELEVATOR_PWM_CENTER 300
#define ELEVATOR_PWM_MAX 600

#define FLAPS_MIN_DEG -30.0f
#define FLAPS_CENTER_DEG 0.0f
#define FLAPS_MAX_DEG 30.0f

#define FLAPS_PWM_MIN 150
#define FLAPS_PWM_CENTER 300
#define FLAPS_PWM_MAX 600

#define THROTTLE_MIN_DEG -30.0f
#define THROTTLE_CENTER_DEG 0.0f
#define THROTTLE_MAX_DEG 30.0f

#define THROTTLE_PWM_MIN 150
#define THROTTLE_PWM_CENTER 300
#define THROTTLE_PWM_MAX 600

#define RUDDER_FEEDBACK_ADC_CHANNEL ADC_CHANNEL_0
#define AILERON_FEEDBACK_ADC_CHANNEL ADC_CHANNEL_1
#define ELEVATOR_FEEDBACK_ADC_CHANNEL ADC_CHANNEL_2
#define FLAPS_FEEDBACK_ADC_CHANNEL ADC_CHANNEL_3
#define THROTTLE_FEEDBACK_ADC_CHANNEL ADC_CHANNEL_4

// --------------------------------

#define RCSOFTCHECK(fn)                                                        \
  do {                                                                         \
    rcl_ret_t temp_rc = (fn);                                                  \
    (void)temp_rc;                                                             \
  } while (0)

static rcl_subscription_t subscriber;
static rcl_subscription_t rudder_subscriber;
static rcl_subscription_t aileron_subscriber;
static rcl_subscription_t elevator_subscriber;
static rcl_subscription_t flaps_subscriber;
static rcl_subscription_t throttle_subscriber;

static rcl_publisher_t rudder_publisher_servo;
static rcl_publisher_t aileron_publisher_servo;
static rcl_publisher_t elevator_publisher_servo;
static rcl_publisher_t flaps_publisher_servo;
static rcl_publisher_t throttle_publisher_servo;
static rcl_publisher_t echo_publisher;

static sensor_msgs__msg__Joy received_msg;
static sensor_msgs__msg__Joy echo_msg;

static std_msgs__msg__Float32 rudder_msg;
static std_msgs__msg__Float32 aileron_msg;
static std_msgs__msg__Float32 elevator_msg;
static std_msgs__msg__Float32 flaps_msg;
static std_msgs__msg__Float32 throttle_msg;

static adc_oneshot_unit_handle_t adc_handle;

void rudder_feedback_adc_init() {
  adc_oneshot_unit_init_cfg_t init_config = {};

  init_config.unit_id = ADC_UNIT_1;

  ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config, &adc_handle));

  adc_oneshot_chan_cfg_t config = {};

  config.bitwidth = ADC_BITWIDTH_12;
  config.atten = ADC_ATTEN_DB_12;

  ESP_ERROR_CHECK(adc_oneshot_config_channel(
      adc_handle, RUDDER_FEEDBACK_ADC_CHANNEL, &config));
}

uint16_t rudder_degrees_to_pwm(float degrees) {
  if (degrees < RUDDER_MIN_DEG)
    degrees = RUDDER_MIN_DEG;

  if (degrees > RUDDER_MAX_DEG)
    degrees = RUDDER_MAX_DEG;

  float normalized =
      (degrees - RUDDER_MIN_DEG) / (RUDDER_MAX_DEG - RUDDER_MIN_DEG);

  float pwm = RUDDER_PWM_MIN + normalized * (RUDDER_PWM_MAX - RUDDER_PWM_MIN);

  return (uint16_t)pwm;
}

uint16_t aileron_degrees_to_pwm(float degrees) {
  if (degrees < AILERON_MIN_DEG)
    degrees = AILERON_MIN_DEG;

  if (degrees > AILERON_MAX_DEG)
    degrees = AILERON_MAX_DEG;

  float normalized =
      (degrees - AILERON_MIN_DEG) / (AILERON_MAX_DEG - AILERON_MIN_DEG);

  float pwm =
      AILERON_PWM_MIN + normalized * (AILERON_PWM_MAX - AILERON_PWM_MIN);

  return (uint16_t)pwm;
}

uint16_t elevator_degrees_to_pwm(float degrees) {
  if (degrees < ELEVATOR_MIN_DEG)
    degrees = ELEVATOR_MIN_DEG;

  if (degrees > ELEVATOR_MAX_DEG)
    degrees = ELEVATOR_MAX_DEG;

  float normalized =
      (degrees - ELEVATOR_MIN_DEG) / (ELEVATOR_MAX_DEG - ELEVATOR_MIN_DEG);

  float pwm =
      ELEVATOR_PWM_MIN + normalized * (ELEVATOR_PWM_MAX - ELEVATOR_PWM_MIN);

  return (uint16_t)pwm;
}

uint16_t flaps_degrees_to_pwm(float degrees) {
  if (degrees < FLAPS_MIN_DEG)
    degrees = FLAPS_MIN_DEG;

  if (degrees > FLAPS_MAX_DEG)
    degrees = FLAPS_MAX_DEG;

  float normalized =
      (degrees - FLAPS_MIN_DEG) / (FLAPS_MAX_DEG - FLAPS_MIN_DEG);

  float pwm = FLAPS_PWM_MIN + normalized * (FLAPS_PWM_MAX - FLAPS_PWM_MIN);

  return (uint16_t)pwm;
}

uint16_t throttle_degrees_to_pwm(float degrees) {
  if (degrees < THROTTLE_MIN_DEG)
    degrees = THROTTLE_MIN_DEG;

  if (degrees > THROTTLE_MAX_DEG)
    degrees = THROTTLE_MAX_DEG;

  float normalized =
      (degrees - THROTTLE_MIN_DEG) / (THROTTLE_MAX_DEG - THROTTLE_MIN_DEG);

  float pwm =
      THROTTLE_PWM_MIN + normalized * (THROTTLE_PWM_MAX - THROTTLE_PWM_MIN);

