terminator0010/Ros2_Drone/Ros2_esp32/main/micro-ros-esp32.cpp
  return (uint16_t)pwm;
}

// --- FUNÇÕES DE CONTROLE DO PCA9685 (I2C) ---

esp_err_t i2c_master_init() {
  i2c_config_t conf = {};
  conf.mode = I2C_MODE_MASTER;
  conf.sda_io_num = I2C_MASTER_SDA_IO;
  conf.scl_io_num = I2C_MASTER_SCL_IO;
  conf.sda_pullup_en = GPIO_PULLUP_ENABLE;
  conf.scl_pullup_en = GPIO_PULLUP_ENABLE;
  conf.master.clk_speed = I2C_MASTER_FREQ_HZ;

  i2c_param_config(I2C_MASTER_NUM, &conf);
  return i2c_driver_install(I2C_MASTER_NUM, conf.mode, 0, 0, 0);
}

void pca9685_write_byte(uint8_t reg, uint8_t data) {
  i2c_cmd_handle_t cmd = i2c_cmd_link_create();
  i2c_master_start(cmd);
  i2c_master_write_byte(cmd, (PCA9685_ADDR << 1) | I2C_MASTER_WRITE, true);
  i2c_master_write_byte(cmd, reg, true);
  i2c_master_write_byte(cmd, data, true);
  i2c_master_stop(cmd);
  i2c_master_cmd_begin(I2C_MASTER_NUM, cmd, 1000 / portTICK_PERIOD_MS);
  i2c_cmd_link_delete(cmd);
}

void pca9685_init() {
  pca9685_write_byte(PCA9685_MODE1, 0x11); // Wake up
  vTaskDelay(pdMS_TO_TICKS(10));
  pca9685_write_byte(PCA9685_PRESCALE, 0x79); // 50Hz para servos
  pca9685_write_byte(PCA9685_MODE1, 0x01);    // Restart
  vTaskDelay(pdMS_TO_TICKS(10));
}

void pca9685_set_pwm(uint8_t canal, uint16_t on, uint16_t off) {
  uint8_t offset = 4 * canal;
  pca9685_write_byte(LED0_ON_L + offset, on & 0xFF);
  pca9685_write_byte(LED0_ON_H + offset, on >> 8);
  pca9685_write_byte(LED0_OFF_L + offset, off & 0xFF);
  pca9685_write_byte(LED0_OFF_H + offset, off >> 8);
}
// --------------------------------------------

void rudder_subscription_callback(const void *msgin) {
  const std_msgs__msg__Float32 *msg = (const std_msgs__msg__Float32 *)msgin;

  last_msg_time = xTaskGetTickCount();

  if (failsafe_active)
    failsafe_active = false;

  float rudder_degrees = msg->data;

  uint16_t pwm_off = rudder_degrees_to_pwm(rudder_degrees);

  pca9685_set_pwm(0, 0, pwm_off);
}

void aileron_subscription_callback(const void *msgin) {
  const std_msgs__msg__Float32 *msg = (const std_msgs__msg__Float32 *)msgin;

  last_msg_time = xTaskGetTickCount();

  if (failsafe_active)
    failsafe_active = false;

  float aileron_degrees = msg->data;

  uint16_t pwm_off = aileron_degrees_to_pwm(aileron_degrees);

  pca9685_set_pwm(0, 0, pwm_off);
}

float read_rudder_position_degrees() {
  int raw = 0;

  if (adc_oneshot_read(adc_handle, RUDDER_FEEDBACK_ADC_CHANNEL, &raw) !=
      ESP_OK) {
    return 0.0f;
  }

  float voltage = ((float)raw / 4095.0f) * 3.3f;

  float degrees =
      RUDDER_MIN_DEG + (voltage / 3.3f) * (RUDDER_MAX_DEG - RUDDER_MIN_DEG);

  if (degrees < RUDDER_MIN_DEG)
    degrees = RUDDER_MIN_DEG;

  if (degrees > RUDDER_MAX_DEG)
    degrees = RUDDER_MAX_DEG;

  return degrees;
}

float read_aileron_position_degrees() {
  int raw = 0;

  if (adc_oneshot_read(adc_handle, AILERON_FEEDBACK_ADC_CHANNEL, &raw) !=
      ESP_OK) {
    return 0.0f;
  }

  float voltage = ((float)raw / 4095.0f) * 3.3f;

  float degrees =
      AILERON_MIN_DEG + (voltage / 3.3f) * (AILERON_MAX_DEG - AILERON_MIN_DEG);

  if (degrees < AILERON_MIN_DEG)
    degrees = AILERON_MIN_DEG;

  if (degrees > AILERON_MAX_DEG)
    degrees = AILERON_MAX_DEG;

  return degrees;
}

float read_elevator_position_degrees() {
  int raw = 0;

  if (adc_oneshot_read(adc_handle, ELEVATOR_FEEDBACK_ADC_CHANNEL, &raw) !=
      ESP_OK) {
    return 0.0f;
  }

  float voltage = ((float)raw / 4095.0f) * 3.3f;

  float degrees = ELEVATOR_MIN_DEG +
                  (voltage / 3.3f) * (ELEVATOR_MAX_DEG - ELEVATOR_MIN_DEG);

  if (degrees < ELEVATOR_MIN_DEG)
    degrees = ELEVATOR_MIN_DEG;

  if (degrees > ELEVATOR_MAX_DEG)
    degrees = ELEVATOR_MAX_DEG;

  return degrees;
}

float read_flaps_position_degrees() {
  int raw = 0;

  if (adc_oneshot_read(adc_handle, FLAPS_FEEDBACK_ADC_CHANNEL, &raw) !=
      ESP_OK) {
    return 0.0f;
  }

  float voltage = ((float)raw / 4095.0f) * 3.3f;

  float degrees =
      FLAPS_MIN_DEG + (voltage / 3.3f) * (FLAPS_MAX_DEG - FLAPS_MIN_DEG);

  if (degrees < FLAPS_MIN_DEG)
    degrees = FLAPS_MIN_DEG;

  if (degrees > FLAPS_MAX_DEG)
    degrees = FLAPS_MAX_DEG;

  return degrees;
}

float read_throttle_position_degrees() {
  int raw = 0;

  if (adc_oneshot_read(adc_handle, THROTTLE_FEEDBACK_ADC_CHANNEL, &raw) !=
      ESP_OK) {
    return 0.0f;
  }

  float voltage = ((float)raw / 4095.0f) * 3.3f;

  float degrees = THROTTLE_MIN_DEG +
                  (voltage / 3.3f) * (THROTTLE_MAX_DEG - THROTTLE_MIN_DEG);

  if (degrees < THROTTLE_MIN_DEG)
    degrees = THROTTLE_MIN_DEG;

  if (degrees > THROTTLE_MAX_DEG)
    degrees = THROTTLE_MAX_DEG;

  return degrees;
}

void rudder_publisher_servo_callback(const void *msgin) {
  const std_msgs__msg__Float32 *msg = (const std_msgs__msg__Float32 *)msgin;

  // Atualiza o Watchdog: Um sinal vital válido foi recebido
  last_msg_time = xTaskGetTickCount();
  if (failsafe_active) {
    // ESP_LOGI(TAG, "SINAL RECUPERADO: Controle nominal retomado.");
    failsafe_active = false;
  }

  // O valor recebido varia de -1.0 a 1.0.
  float rudder_val = msg->data;

  // Limitação de segurança (clamp)
  if (rudder_val < -1.0f)
    rudder_val = -1.0f;
  if (rudder_val > 1.0f)
    rudder_val = 1.0f;

  // Conversão para o PCA9685 (resolução de 12 bits, 0-4095) a 50Hz.
  // 1ms (0 graus) ~= 204. 2ms (180 graus) ~= 409. Centro (90 graus) = 307.
  // Para abranger um arco ligeiramente maior com segurança, usaremos o range de
  // 150 a 600 (centro 00).
  uint16_t pwm_off = 300 + (uint16_t)(rudder_val * 300);

  // Envia o comando I2C para o PCA9685 no Canal 0
  pca9685_set_pwm(0, 0, pwm_off);
}

void flightgear_subscription_callback(const void *msgin) {
  const sensor_msgs__msg__Joy *incoming_msg =
      (const sensor_msgs__msg__Joy *)msgin;

  // Copia os eixos (limitado ao tamanho máximo)
  size_t axes_to_copy = incoming_msg->axes.size;
  if (axes_to_copy > MAX_AXES)
    axes_to_copy = MAX_AXES;

  echo_msg.axes.size = axes_to_copy;
  for (size_t i = 0; i < axes_to_copy; i++) {
    echo_msg.axes.data[i] = incoming_msg->axes.data[i];
  }

  // Copia os botões (limitado ao tamanho máximo)
  size_t buttons_to_copy = incoming_msg->buttons.size;
  if (buttons_to_copy > MAX_BUTTONS)
    buttons_to_copy = MAX_BUTTONS;

  echo_msg.buttons.size = buttons_to_copy;
  for (size_t i = 0; i < buttons_to_copy; i++) {
    echo_msg.buttons.data[i] = incoming_msg->buttons.data[i];
  }

