terminator0010/Ros2_Drone/Ros2_esp32/main/micro-ros-esp32.cpp
  RCSOFTCHECK(rcl_publish(&echo_publisher, &echo_msg, NULL));
}

void micro_ros_task(void *arg) {
  (void)arg;

  // --- ALOCAÇÃO DE MEMÓRIA DINÂMICA SEGURA ---
  received_msg.axes.capacity = MAX_AXES;
  received_msg.axes.data =
      (float *)malloc(received_msg.axes.capacity * sizeof(float));
  received_msg.axes.size = 0;

  echo_msg.axes.capacity = MAX_AXES;
  echo_msg.axes.data = (float *)malloc(echo_msg.axes.capacity * sizeof(float));
  echo_msg.axes.size = 0;

  received_msg.buttons.capacity = MAX_BUTTONS;
  received_msg.buttons.data =
      (int32_t *)malloc(received_msg.buttons.capacity * sizeof(int32_t));
  received_msg.buttons.size = 0;

  echo_msg.buttons.capacity = MAX_BUTTONS;
  echo_msg.buttons.data =
      (int32_t *)malloc(echo_msg.buttons.capacity * sizeof(int32_t));
  echo_msg.buttons.size = 0;

  received_msg.header.frame_id.capacity = MAX_STRING_LEN;
  received_msg.header.frame_id.data =
      (char *)malloc(MAX_STRING_LEN * sizeof(char));
  received_msg.header.frame_id.size = 0;

  echo_msg.header.frame_id.capacity = MAX_STRING_LEN;
  echo_msg.header.frame_id.data = (char *)malloc(MAX_STRING_LEN * sizeof(char));
  echo_msg.header.frame_id.size = 0;
  // ---------------------------------------------

  rcl_allocator_t allocator = rcl_get_default_allocator();
  rclc_support_t support;
  rcl_node_t node;
  rclc_executor_t executor;

  while (1) {
    // ESP_LOGI(TAG, "Tentando conectar ao micro-ROS agent...");

    if (rclc_support_init(&support, 0, NULL, &allocator) != RCL_RET_OK) {
      vTaskDelay(2000 / portTICK_PERIOD_MS);
      continue;
    }

    node = rcl_get_zero_initialized_node();
    if (rclc_node_init_default(&node, "esp32_control_node", "", &support) !=
        RCL_RET_OK) {
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    echo_publisher = rcl_get_zero_initialized_publisher();
    if (rclc_publisher_init_default(
            &echo_publisher, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, Joy),
            "flightgear_attitude_echo") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    subscriber = rcl_get_zero_initialized_subscription();
    if (rclc_subscription_init_default(
            &subscriber, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, Joy),
            "flightgear_attitude") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_publisher_fini(&echo_publisher, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    rudder_publisher_servo = rcl_get_zero_initialized_publisher();
    if (rclc_publisher_init_default(
            &rudder_publisher_servo, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
            "rudder_pos_servo_echo") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    rudder_subscriber = rcl_get_zero_initialized_subscription();
    if (rclc_subscription_init_default(
            &rudder_subscriber, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
            "rudder_pos") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_publisher_fini(&rudder_publisher_servo, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    aileron_subscriber = rcl_get_zero_initialized_subscription();
    if (rclc_subscription_init_default(
            &aileron_subscriber, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
            "aileron_pos") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_publisher_fini(&aileron_publisher_servo, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    elevator_subscriber = rcl_get_zero_initialized_subscription();
    if (rclc_subscription_init_default(
            &elevator_subscriber, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
            "elevator_pos") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_publisher_fini(&elevator_publisher_servo, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    flaps_subscriber = rcl_get_zero_initialized_subscription();
    if (rclc_subscription_init_default(
            &flaps_subscriber, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
            "flaps_pos") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_publisher_fini(&flaps_publisher_servo, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    throttle_subscriber = rcl_get_zero_initialized_subscription();
    if (rclc_subscription_init_default(
            &throttle_subscriber, &node,
            ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
            "throttle_pos") != RCL_RET_OK) {
      RCSOFTCHECK(rcl_publisher_fini(&throttle_publisher_servo, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    executor = rclc_executor_get_zero_initialized_executor();
    if (rclc_executor_init(&executor, &support.context, 2, &allocator) !=
        RCL_RET_OK) {
      RCSOFTCHECK(rcl_subscription_fini(&rudder_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&subscriber, &node));
      RCSOFTCHECK(rcl_publisher_fini(&echo_publisher, &node));
      RCSOFTCHECK(rcl_subscription_fini(&aileron_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&elevator_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&flaps_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&throttle_subscriber, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    if (rclc_executor_add_subscription(&executor, &subscriber, &received_msg,
                                       &flightgear_subscription_callback,
                                       ON_NEW_DATA) != RCL_RET_OK) {
      RCSOFTCHECK(rclc_executor_fini(&executor));
      RCSOFTCHECK(rcl_subscription_fini(&rudder_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&aileron_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&elevator_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&flaps_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&throttle_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&subscriber, &node));
      RCSOFTCHECK(rcl_publisher_fini(&echo_publisher, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

