terminator0010/Ros2_Drone/Ros2_esp32/main/micro-ros-esp32.cpp
    if (rclc_executor_add_subscription(
            &executor, &rudder_subscriber, &rudder_msg,
            &rudder_publisher_servo_callback, ON_NEW_DATA) != RCL_RET_OK) {
      RCSOFTCHECK(rclc_executor_fini(&executor));
      RCSOFTCHECK(rcl_subscription_fini(&rudder_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&aileron_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&elevator_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&flaps_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&throttle_subscriber, &node));
      RCSOFTCHECK(rcl_subscription_fini(&subscriber, &node));
      RCSOFTCHECK(rcl_publisher_fini(&echo_publisher, &node));
      RCSOFTCHECK(rcl_node_fini(&node));
      RCSOFTCHECK(rclc_support_fini(&support));
      vTaskDelay(1000 / portTICK_PERIOD_MS);
      continue;
    }

    // ESP_LOGI(TAG, "Conectado! Aguardando comandos...");

    // Inicia a contagem do Watchdog no momento da conexão bem-sucedida
    last_msg_time = xTaskGetTickCount();

    while (1) {
      rcl_ret_t rc = rclc_executor_spin_some(&executor, RCL_MS_TO_NS(100));

      rudder_msg.data = read_rudder_position_degrees();
      aileron_msg.data = read_aileron_position_degrees();
      elevator_msg.data = read_elevator_position_degrees();
      flaps_msg.data = read_flaps_position_degrees();
      throttle_msg.data = read_throttle_position_degrees();

      RCSOFTCHECK(rcl_publish(&rudder_publisher_servo, &rudder_msg, NULL));
      RCSOFTCHECK(rcl_publish(&aileron_publisher_servo, &aileron_msg, NULL));
      RCSOFTCHECK(rcl_publish(&elevator_publisher_servo, &elevator_msg, NULL));
      RCSOFTCHECK(rcl_publish(&flaps_publisher_servo, &flaps_msg, NULL));
      RCSOFTCHECK(rcl_publish(&throttle_publisher_servo, &throttle_msg, NULL));

      if (rc != RCL_RET_OK && rc != RCL_RET_TIMEOUT) {
        // ESP_LOGE(TAG, "Conexão perdida (Erro Executor). Reiniciando nós...");
        break;
      }

      // --- LÓGICA DO WATCHDOG ---
      TickType_t current_time = xTaskGetTickCount();
      uint32_t time_since_last_msg =
          (current_time - last_msg_time) * portTICK_PERIOD_MS;

      if (time_since_last_msg > FAILSAFE_TIMEOUT_MS) {
        if (!failsafe_active) {
          /* ESP_LOGE(TAG,
                   "ALERTA CRÍTICO: Timeout da rede (>%d ms)! Acionando Modo "
                   "Failsafe.",
                   FAILSAFE_TIMEOUT_MS); */

          // Centraliza o leme (posição segura 375 = ~90 graus)
          pca9685_set_pwm(0, 0, 300);

          failsafe_active = true;
        }
      }
      // --------------------------

      vTaskDelay(10 / portTICK_PERIOD_MS);
    }

    RCSOFTCHECK(rcl_publisher_fini(&echo_publisher, &node));
    RCSOFTCHECK(rcl_publisher_fini(&rudder_publisher_servo, &node));
    RCSOFTCHECK(rcl_subscription_fini(&rudder_subscriber, &node));
    RCSOFTCHECK(rcl_subscription_fini(&aileron_subscriber, &node));
    RCSOFTCHECK(rcl_subscription_fini(&elevator_subscriber, &node));
    RCSOFTCHECK(rcl_subscription_fini(&flaps_subscriber, &node));
    RCSOFTCHECK(rcl_subscription_fini(&throttle_subscriber, &node));
    RCSOFTCHECK(rcl_subscription_fini(&subscriber, &node));
    RCSOFTCHECK(rclc_executor_fini(&executor));
    RCSOFTCHECK(rcl_node_fini(&node));
    RCSOFTCHECK(rclc_support_fini(&support));

    // Failsafe de desconexão física: ativado imediatamente se o loop do
    // executor for quebrado
    if (!failsafe_active) {
      /* ESP_LOGE(TAG, "ALERTA CRÍTICO: Conexão USB/Serial interrompida! "
                    "Acionando Failsafe."); */
      pca9685_set_pwm(0, 0, 300);
      failsafe_active = true;
    }

    vTaskDelay(2000 / portTICK_PERIOD_MS);
  }
}

// O extern "C" é obrigatório aqui para o ESP-IDF encontrar a função

extern "C" void app_main(void) {
  static uart_port_t uart_port = UART_NUM_0;

  // Configura o transporte para usar a porta serial nativa do ESP32
  rmw_uros_set_custom_transport(true, (void *)&uart_port, esp32_serial_open,
                                esp32_serial_close, esp32_serial_write,
                                esp32_serial_read);

  // Inicialização do barramento I2C e configuração do Driver PCA9685
  ESP_ERROR_CHECK(i2c_master_init());
  pca9685_init();

  // Inicia com o servo fisicamente travado no centro até a primeira mensagem de
  // rede
  pca9685_set_pwm(0, 0, 300);

  xTaskCreatePinnedToCore(micro_ros_task, "uros_task",
                          MICRO_ROS_TASK_STACK_SIZE, NULL,
                          MICRO_ROS_TASK_PRIORITY, NULL, 1);
}